import matplotlib.pyplot as plt
import numpy as np

# a = np.array([1, 2, 3, 4]) #. Создаём массив из списка. Список можно заранее записать в переменную.
# a = np.zeros((3, 3)) # заполненный нулями. В круглых скобках мы ставим ещё одни круглые скобки и пишем числа, которые обозначают размер массива. Первое число — количество списков (строк), второе — количество элементов в списке.
# a = np.ones((2, 5)) # заполненный единицами
# a = np.random.random((2, 5)) # заполненный случайными числами
# a = np.arange(0, 10, 2) # заполненный числами от 0 до 10 с шагом 2
# a = np.linspace(0, 1, 10) # заполненный числами от 0 до 1 с шагом 0.1
# print(a)

x = np.linspace(-10, 10, 100) # создаём массив из 100 чисел от -10 до 10

y = x ** 2

plt.plot(x, y) #Создаём график:
plt.xlabel("Ось X")
plt.ylabel("Ось Y")
plt.title("Пример простого линейного графика")
plt.grid(True) #Делаем сетку на фоне графика:
plt.show()